app/views/documents/index.html.haml

	#documents.clearfix
		- unless current_account.documents.blank?
---
SELECT "documents".* FROM "documents"