app/controllers/accounts_controller.rb

  def plans
    @plans = SubscriptionPlan.order('amount desc').collect {|p| p.discount = @discount; p }
---
SELECT "subscription_plans".* FROM "subscription_plans"  ORDER BY amount desc

  def plan
    if request.post?
      @subscription.plan = SubscriptionPlan.find(params[:plan_id])

      if @subscription.save
---
SELECT  "subscription_plans".* FROM "subscription_plans" WHERE "subscription_plans"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "subscriptions" SET "user_limit" = $1, "amount" = $2, "subscription_plan_id" = $3, "updated_at" = $4 WHERE "subscriptions"."id" = $5  [["user_limit", 5], ["amount", "10.0"], ["subscription_plan_id", 2], ["updated_at", "2015-09-22 16:41:12.621648"], ["id", 1]]

    def load_discount
      if params[:discount].blank? || !(@discount = SubscriptionDiscount.find_by_code(params[:discount])) || !@discount.available?
---
SELECT  "subscription_discounts".* FROM "subscription_discounts" WHERE "subscription_discounts"."code" = $1 LIMIT 1  [["code", "bar"]]