app/controllers/documents_controller.rb

	def index
		if params[:tag]
    			@documents = Document.tagged_with(params[:tag])
  		else
			@documents = Document.all
---
SELECT "documents".* FROM "documents"
SELECT "tags".* FROM "tags"

	def create
		@document = Document.new(document_params)
		if @document.save
---
INSERT INTO "documents" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "First Doc"], ["description", "Test Doc"], ["created_at", "2015-09-22 16:22:48.891343"], ["updated_at", "2015-09-22 16:22:48.891343"]]

	def find_document
		@document = Document.find(params[:id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT 1  [["id", 1]]