app/controllers/steps_controller.rb

  def find_document
	  @document = Document.find(params[:document_id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT 1  [["id", 1]]

  def find_step
  	@step = @document.steps.find(params[:id])
---
SELECT "steps".* FROM "steps" WHERE "steps"."document_id" = $1  [["document_id", 1]]